package Lab03;

import java.util.Scanner;

public class Lab30151 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Введіть нижню межу діапазону: ");
        double lowerBound = scanner.nextDouble();
        //Вводимо нижню границю
        System.out.print("Введіть верхню межу діапазону: ");
        double upperBound = scanner.nextDouble();
        //Вводимо верхню границю
        double step = 0.2;
        // Крок ітерації циклу.
        int count = 0;
        // Містить кількість значень функції в заданому діапазоні
        double x = -2.0;

        while (x <= 2.0)
        //початок циклу while, який буде виконуватись доки x не перевищить значення 2
        {
            double y = 2 * x * Math.sin(x) - Math.cos(x);
            //Обчислює значення функції за формулою
            if (y >= lowerBound && y <= upperBound)
            // перевірка, чи належить значення функції діапазону
            {
                count++;//якщо значення функції належить діапазону, то збільшити лічильник кількості значень функції, що належать діапазону
            }

            System.out.printf("f(%.1f) = %.4f%n", x, y);
        //виведення на екран значення функції з точністю до 4 знаків після коми
            x += step;//збільшення значення аргументу на заданий крок
        }

        if (count == 0)
        //перевірка, чи були знайдені значення функції, що належать заданому діапазону
        {
            System.out.println("У діапазоні немає значень.");
        //виведення на екран повідомлення про відсутність значень функції в заданому діапазоні
        } else {
            System.out.printf("У діапазоні %d значень.%n", count);
        //виведення на екран кількості значень функції, що належать заданому діапазону
        }
    }
}